examples/gks_flux_validation/fourierSlabPr04/0/U
FoamFile { version 2.0; format ascii; class volVectorField; location "0"; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    left { type fixedValue; value uniform (0 0 0); }
    right { type fixedValue; value uniform (0 0 0); }
    yMin { type symmetryPlane; }
    yMax { type symmetryPlane; }
    zEmpty { type empty; }
}
